import 'package:flutter/material.dart';

import '../../../constants.dart';
import '../../widgets/componemts/components.dart';

class AzkarMo5tara extends StatefulWidget {
  @override
  _AzkarMo5taraState createState() => _AzkarMo5taraState();
}

class _AzkarMo5taraState extends State<AzkarMo5tara> {
  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        backgroundColor: m3Color,
        body: ListView(physics: BouncingScrollPhysics(), children: [
          AzkarMo5(
              t1: 'دعاء الهم والحزن',
              t2: ' اللهم إني عبدك ابن عبدك ابن أمتك ناصيتي بيدك ماض في حكمك ، عدل في قضاؤك أسألك بكل اسم هو لك سميت به نفسك أو أنزلته في كتابك ، أو علمته أحداً من خلقك أو استأثرت به في علم الغيب عندك أن تجعل القرآن ربيع قلبي ، ونور صدري وجلاء حزني وذهاب همي, اللهم إني أعوذ بك من الهم والحزن والعجز والكسل والبخل والجبن ، وضلع الدين وغلبة الرجال',
              count: ''),
          AzkarMo5(
              t1: 'دعاء قضاء الدين',
              t2: 'اللهم اكفنى بحلالك عن حرامك وأغننى بفضلك عمن سواك ',
              count: ''),
          AzkarMo5(
              t1: 'دعاء زيارة القبور',
              t2: 'السلام عليكم أهل الديار من المؤمنين والمسلمين، وإنا إن شاء الله بكم لاحقون ويرحم الله المستقدمين منا والمستأخرين، أسأل الله لنا ولكم العافية',
              count: ''),
          AzkarMo5(
              t1: 'دعـاء صـلاة الاستخـارة',
              t2: 'قال جابر بن عبدالله رضي الله عنهما : كان رسول الله صلى الله عليه وسلم يعلمنا الاستخارة في الامور كلها كما يعلمنا السورة من القرآن ، يقول : ( إذا هم أحدكم بالأمر فليركع ركعتين من غير الفريضة ثم ليقل : اللهم إني أستخيرك بعلمك ، وأستقدرك بقدرتك وأسألك من فضلك العظيم فإنك تقدر ولا أقدر وتعلم ولاأعلم وأنت علام الغيوب ، اللهم إن كنت تعلم أن هذا الأمر ـ ويسمي حاجته ـ خيرا لي في ديني ومعاشي وعاقبة أمري ـ أو قال عاجله وآجله ـ فأقدره لي ويسره لي ثم بارك لي فيه ، وإن كنت تعلم أن هذا الأمر شر لي في ديني ومعاشي وعاقبة أمري ـ أو قال عاجله وآجله ـ فاصرفه عني واصرفني عنه واقدر لي الخير حيث كان ثم ارضني به)',
              count: ''),
          AzkarMo5(
              t1: 'دعـاء سجود التلاوة',
              t2: 'سجد وجهي للذي خلقه ،وشق سمعه وبصره بحوله وقوته ( فتبارك الله احسن الخالقين ) ',
              count: ''),
          AzkarMo5(
              t1: 'دعـــــاء الاستفــتــــاح',
              t2: ' اللهم باعد بيني وبين خطاياي كما باعدت بين المشرق والغرب ، اللهم نقني من خطاياي كما ينقى الثوب الأبيض من الدنس، اللهم اغسلني من خطاياي بالثلج والماء والبرد. سبحانك اللهم وبحمدك وتبارك اسمك وتعالى جدُّك ولاإله غيرك. الله اكبر كبيرا ، الله اكبر كبيرا ، الله اكبر كبيرا ، والحمد لله كثيرا ، والحمد لله كثيرا ، والحمد لله كثيرا ، وسبحان الله بكرة وأصيلا(ثلاثـــا) ـ "اعوذ بالله من الشيطان من نفحه ونفثه وهمزه"',
              count: ''),
          AzkarMo5(
              t1: 'عنــــد فعــــل الذنب أو ارتكاب المعصية',
              t2: 'كما أخبرنا رسول الله صلى الله عليه وسلم ((ما من عبد يذنب ذنباً فيتوضأ فيحسن الطهور،ثم يقوم فيصلي ركعتين ، ثم يستغفر الله لذلك الذنب إلاَّ غُفر له ))',
              count: ''),
          AzkarMo5(
              t1: 'سيد الاستغفار',
              t2: ' اللهم أنت ربي لا إله إلا أنت ، خلقتني وأنا عبدك وأنا على عهدك ووعدك ما استطعت أعوذ بك من شر ما صنعت، أبوئ لك بنعمتك على وأبوئ بذنبي ، فاغفر لي فانه لا يغفر الذنوب إلا أنت. عن شداد بن أوس رضي الله عنه عن النبي صلى الله عليه وسلم قال ( سيد الاستغفار أن يقول العبد اللهم أنت ربي لا إله إلا أنت ، خلقتني وأنا عبدك وأنا على عهدك ووعدك ما استطعت أعوذ بك من شر ما صنعت، أبوئ لك بنعمتك على وأبوئ بذنبي ، فاغفر لي فانه لا يغفر الذنوب إلا أنت ) من قالها في النهار موقناً بها فمات من يومه قبل أن يمسي فهو من أهل الجنة ومن قالها من الليل وهو موقناً بها فمات قبل أن يصبح فهو من أهل الجنة . أخرجه البخاري',
              count: ''),
          AzkarMo5(
              t1: 'الدعـــاء إذا أحسست بوجع في جسدك',
              t2: 'ضع يدك على الذي تألَّم من جسدك وقل: بسم الله ،ثلاثاً ،وقل سبع مرات: أعوذُ بالله وقُدْرَتِهِ من شَرِّ مَا أَجِدُ واُحَاذِرُ',
              count: ''),
          AzkarMo5(
              t1: 'مايقول ويفعل من أذنب ذنباً',
              t2: 'مامن عبد يذنب ذنباً فيحسـن الطهور ثم يقوم فيصلي ركعتين ، ثم يستغــفــر الله إلا غفر له ',
              count: ''),
          AzkarMo5(
              t1: 'دعاء لبس الثوب',
              t2: 'الحمدُ للهِ الّذي كَساني هذا (الثّوب) وَرَزَقَنيه مِنْ غَـيـْرِ حَولٍ مِنّي وَلا قـوّة',
              count: ''),
          AzkarMo5(
              t1: 'دعاء لبس الثوب الجديد',
              t2: 'اللهم لك الحمد أنت كسوتنيه، أسألك من خيره ',
              count: ''),
          AzkarMo5(
              t1: 'دعاء الكرب',
              t2: ' لا إله إلا الله العظيم الحليم، لا إله إلا الله رب العرش العظيم، لا إله إلا الله رب السماوات، ورب الأرض ورب العرش الكريم ,اللهم رحمتك أرجو فلا تكلني إلى نفسي طرفة عين وأصلح لي شأني كله ، لا إله إلا أنت ,لا إله إلا أنت سبحانك إني كنت من الظالمين ,الله الله رب لا أشرك به شيئا ',
              count: ''),
          AzkarMo5(
              t1: 'دعاء الريح',
              t2: 'اللهم إنى أسألك خيرها، وخير ما فيها، وخير ما أرسلت به، وأعوذ بك من شرها، وشر ما فيها وشر ما أرسلت به',
              count: ''),
          AzkarMo5(t1: 'دعاء نزول االمطر', t2: 'اللهم صيباَ نافعاَ', count: ''),
          AzkarMo5(
              t1: 'دعاء السفر',
              t2: 'اللهم إنا نسألك في سفرنا هذا البر والتقوى، ومن العمل ماترضى ، اللهم هون علينا سفرنا هـذا واطوِ عنا بعده، اللهم أنت الصاحب في السفر، والخليفة في الأهل، اللهم إني أعوذ بك من وعثاء السفر وكآبة المنظر وسوء المنقلب في المال والأهل. وإذا رجع قالهن وزاد فيهن ـ" آيبون ،تآئبون، عابدون ، لربنا حامدون',
              count: ''),
          AzkarMo5(
              t1: 'دعاء المسافر للمقيم',
              t2: 'استودعكم الله الذي لا تضيع ودائعه ',
              count: ''),
          AzkarMo5(
              t1: 'دعاء المقيم للمسافر',
              t2: 'أستودع ُ الله دينك وأمانتك ، وخواتيم عملك زودك الله التقوى، وغفر ذنبك، ويسر لك الخير حيث ما كنت',
              count: ''),
          AzkarMo5(
              t1: 'دعـــاء النـــزول في مكــان',
              t2: 'أعوذ بكلمات الله التامات من شر ما خلق',
              count: ''),
          AzkarMo5(
              t1: 'الدعاء بين السجدتين',
              t2: 'رب اغفر لي رب اغفر لي اللهم اغفر لي ، وارحمني واهدني واجبرني وعافني وارزقني وارفعني',
              count: ''),
          AzkarMo5(
              t1: 'دعـاء من استصعب عليه أمر',
              t2: 'اللهم لاسهل إلا ماجعلته سهلا وأنت تجعل الحزن إذا شئت سهلا ',
              count: ''),
          AzkarMo5(
              t1: 'دعـاء الخوف من الشــرك',
              t2: 'اللهم إني أ عوذ بك أن أشرك بك وأنا أعلم ، وأستغفرك لما لا أعلم ',
              count: ''),
          AzkarMo5(
              t1: 'ما يقال في المجلس',
              t2: 'رب اغفر لي وتب عليّ إنك أنت التواب الغفور (100 مرة قبل أن يقوم) ',
              count: ''),
          AzkarMo5(
              t1: 'كفارة المجلس',
              t2: 'سبحانك اللهم وبحمدك ، أشهد أن لا إله إلا أنت أستغفرك وأتوب إليك ',
              count: ''),
          AzkarMo5(
              t1: 'دعاء من رأى مبتلى',
              t2: 'الحمد لله الذي عافاني مما ابتلا به وفضلني على كثير ممن خلق تفضيلاً ',
              count: ''),
          AzkarMo5(
              t1: 'دعـاء الغـضـب',
              t2: 'أعوذ بالله من الشيطان الرجيـم',
              count: ''),
          AzkarMo5(
              t1: 'الدعاء للمتزوج',
              t2: 'بارك الله لك ، وبارك عليك ، وجمع بينكما في خير',
              count: ''),
          AzkarMo5(
              t1: 'دعاء المتزوج لنفسه',
              t2: 'اللهم إني أسألك خيرها وخير ماجبلتها عليه وأعوذ بك من شرها وشر ماجبلتها عليه ، وإذا اشترى بعيراً فليأخذ بذروة سنامه وليقل مثل ذلك',
              count: ''),
          AzkarMo5(
              t1: 'الدعاء قبل الجماع',
              t2: 'بسم الله ـ اللهم جنبنا الشيطان، وجنب الشيطان مارزقتنا ',
              count: ''),
          AzkarMo5(
              t1: 'دعاء العطاس',
              t2: 'إذا عطـس أحـدكم فليقل : الحمـد لله ، وليقل له أخـوه ، أو صاحبه : يرحمـك الله فـإذا قال له : يرحمك الله ، فليقل : يهديكم الله ويصلح بالكم',
              count: ''),
          AzkarMo5(
              t1: 'الدعاء عند افطار الصائم',
              t2: 'ذهب الضمـأ ، وأبتلت العروق ، وثبت الأجر إن شاء الله ',
              count: ''),
          AzkarMo5(
              t1: 'الدعاء إذا أفطر عند أهل بيت',
              t2: 'أفطر عندكم الصائمون ، وأكل طعامكم الأبرار ، وصلت عليكم الملائكة ',
              count: ''),
          AzkarMo5(
              t1: 'دعاء رؤية الهلال',
              t2: 'الله أكبر ، اللهم أهله علينا بالأمن ، والإيمان والسلامة ، والإسلام ، والتوفيق لما تحب وترضى ربنا وربك الله',
              count: ''),
          AzkarMo5(
              t1: 'دعاء من أصيب بمصيبة',
              t2: 'إنا لله وإنا إليه راجعون اللهم أجرني في مصيبتي واخلف لي خيرا منها ',
              count: ''),
          AzkarMo5(
              t1: 'الدعاء للمريض في عيادته',
              t2: 'لابأس طهور إن شاء الله مامن عبد مسلم يعود مريضاً لم يحضر أجله فيقول سبع مرات : أسأل الله العظيم رب العرش العظيم أن يشفيك إلا عوفي',
              count: ''),
          AzkarMo5(
              t1: 'دعاء المريض الذي يئس من حياته',
              t2: 'اللهم اغفر لي وارحمني والحقني بالرفيق الأعلى ',
              count: ''),
          AzkarMo5(
              t1: 'ما يعوذ به الأولاد',
              t2: 'أعيذكما بكلمات الله التامة من كل شيطان وهامة ، ومن كل عين لامة ',
              count: ''),
        ]),
      ),
    );
  }
}
